[
  {
    "path": "posts/2021-11-24-a-quelle-heure-votent-les-cyclistes/",
    "title": "À quelle heure votent les cyclistes ?",
    "description": "Analyse de la participation au Baromètres des villes cyclables 2019 avec le package lubridate",
    "author": [
      {
        "name": "Maxime Agator",
        "url": {
          "https://mxagat.github.io/donnees-de-curiosite/": {}
        }
      }
    ],
    "date": "2021-11-24",
    "categories": [
      "R",
      "vélo",
      "analyses"
    ],
    "contents": "\r\n\r\nContents\r\nImportation sous R et reconnaissance des heures avec lubridate\r\nTraitement\r\nVisualisation et résultat\r\nConclusion\r\n\r\n\r\nbody {\r\ntext-align: justify}\r\nDepuis 2017, la Fédération des Usagers de la Bicyclette (FUB) organise une enquête nationale sur l’expérience des usagers du vélo en ville, le Baromètre des villes cyclables. Cette enquête est parmi les plus importantes au monde sur ce thème, et recueille le point de vue d’usagers sur différents aspects de leur expérience : sentiment de sécurité, qualité des aménagements, écoute de la mairie, disponibilité de vélos en location de courte durée ou de stationnement sécurisé, etc. J’aimerais m’intéresser ici non pas au contenu des évaluations laissées par les cyclistes mais à la dynamique de ce type d’enquête en ligne :\r\nÀ quel moment participe-t-on le plus à une enquête associative auto-administrée en ligne ?\r\nDu point de vue des associations, savoir à quelle heure les usagers sont les plus susceptibles de remplir le baromètre pourrait leur permettre de diffuser plus efficacement les appels à participer, par exemple sur les réseaux sociaux.\r\nLe Baromètre de 2021 est encore en cours, mais les données brutes de participation de 2019 sont accessibles1 ; elles devraient nous permettre de répondre à la question. On y retrouve en format CSV les 184 482 votes validées entre le 2 septembre et le 30 novembre, avec une colonne qui nous intéresse particulièrement : “Submit Date (UTC)”.\r\nAperçu du fichier détailléImportation sous R et reconnaissance des heures avec lubridate\r\nAprès avoir importé le fichier détail, le package lubridate permet de reconnaitre le format date-heure, ici récupéré sous forme “mois/jour/année heure:minute/seconde” à l’heure universelle, et de le passer à l’heure de Paris (CET, ou UTC+1). On peut ensuite passer directement au traitement de nos données et à leur analyse.\r\n\r\n\r\nVoir le code\r\n\r\n#chargement des librairies\r\nlibrary(data.table)\r\nlibrary(tidyverse)\r\nlibrary(lubridate)\r\nlibrary(questionr)\r\n\r\n#importation des données, en ne gardant que les colonnes code INSEE, ville et date\r\nbarom <- fread(\"data/Barom2019_FD.CSV\", encoding=\"UTF-8\", sep=\",\", header = TRUE, dec = \".\")[,c(2,4,6)]\r\n\r\ncolnames(barom) <- c(\"code_insee\",\"ville\",\"date_vote_brute\")\r\n\r\n# Création d'une nouvelle colonne heure-date avec lubridate, mise à l'heure de Paris. \r\nbarom <-barom %>%\r\n  mutate(heure_date_Paris = mdy_hms(date_vote_brute), .before=1)%>%\r\n  with_tz(\"Europe/Paris\")%>%\r\n  arrange(heure_date_Paris) \r\n\r\n\r\n\r\nTraitement\r\nAfin de représenter les heures auxquelles les cyclistes répondent le plus en ligne au baromètre, une visualisation de la répartition des réponses sur une journée est probablement le plus éclairant. Toutefois, on peut faire l’hypothèse d’éventuels écarts entre jours de la semaine, ou selon certaines dates particulières comme les deux jours feriés de la période. Ce graphique de la répartition des votes par date nous permet de le vérifier :\r\n\r\n\r\nVoir le code\r\n\r\nbarom %>%\r\n ggplot() +\r\n  aes(x = heure_date_Paris) +\r\n  geom_histogram(bins = 90L, fill = \"lightblue\", color = \"cornflower blue\",  alpha=0.9) +\r\n  labs(\r\n    x = \"Date\",\r\n    y = \"Nombre de votes\",\r\n    title = \"Répartition des votes sur la durée de l'enquête\"\r\n  ) +\r\n  theme_minimal()+\r\n  theme(plot.title = element_text(hjust = 0.5))\r\n\r\n\r\n\r\n\r\nOn repère ici nettement des variations hebdomadaires ainsi que trois pics correspondant probablement à des actions de promotion réalisées par la FUB. Notons aussi que si la période de vote s’étend du 2 septembre au 30 novembre, le nombre de vote est très faible jusqu’à la mi-septembre. Le lancement officiel n’ayant eu lieu que le 12 septembre, il est très probable que les votes antérieurs à cette date proviennent de membres d’associations cyclistes composant la FUB et disposant du lien avant le lancement. J’exclus donc la période jusqu’au 13 septembre de mon analyse. Bien que les jours fériés (1er et 11 novembre) ne soient pas directement repérables sur le graphique, je les exclus également pour éviter de fausser légèrement l’analyse par jour de la semaine.\r\n\r\n\r\nVoir le code\r\n\r\n# On ajoute trois colonnes séparées: date, heure, jour de la semaine à partir de la colonne heure_date_Paris)\r\n\r\nbarom2 <- barom %>% select(!date_vote_brute) %>%\r\n  mutate(date = date(\r\n  heure_date_Paris),\r\n  jour = wday(heure_date_Paris) %>% as.factor(),\r\n  heure = hour(heure_date_Paris)\r\n)\r\n\r\n# Recodage des noms de jours et réordonnancement des facteurs pour mettre le dimanche en dernier\r\nbarom2$jour <- fct_recode(barom2$jour,\r\n  \"dimanche\" = \"1\",\r\n  \"lundi\" = \"2\",\r\n  \"mardi\" = \"3\",\r\n  \"mercredi\" = \"4\",\r\n  \"jeudi\" = \"5\",\r\n  \"vendredi\" = \"6\",\r\n  \"samedi\" = \"7\"\r\n)\r\n\r\nbarom2$jour <- fct_relevel(\r\n  barom2$jour,\r\n  \"lundi\", \"mardi\", \"mercredi\", \"jeudi\", \"vendredi\", \"samedi\",\r\n  \"dimanche\"\r\n)\r\n\r\n# Retrait des dates avant le 13 septembre et des deux jours feriés\r\nbarom2 <- barom2 %>% filter(date >= \"2019-09-13\" &  date !=\"2019-11-01\" & date != \"2019-11-11\")\r\n\r\n\r\n\r\nVisualisation et résultat\r\nNous pouvons désormais représenter la moyenne de réponses reçues par heure et jour de la semaine, ce qui donne le résultat suivant :\r\n\r\n\r\nVoir le code\r\n\r\n# Dernier traitement pour préparer la visualisation : obtenir une moyenne par heure et jour\r\nvotes <- barom2 %>% filter(date !=\"2019-11-25\") %>% \r\n  group_by(date,jour,heure) %>%\r\n  count %>%\r\n  ungroup %>%\r\n  select(-date)%>%\r\n  group_by(jour,heure) %>%\r\n  summarise (moy_vote = round(mean(n)))\r\n\r\n# Visualisation avec ggplot2\r\nggplot(votes) +\r\n aes(x = heure, y = moy_vote, colour = jour) +\r\n geom_line(size = 1.1) +\r\n scale_color_brewer(palette = \"Dark2\", \r\n direction = 1) +\r\n theme_bw()+\r\n scale_x_continuous(breaks=seq(1,24,by=2))+\r\n  labs(\r\n    x = \"Heure\",\r\n    y = \"Nombre de votes moyen\",\r\n    title = \"Quand les cyclistes votent-ils au Baromètre des villes cyclables ?\",\r\n    subtitle = \"Moyenne des votes par jour et heure au Baromètre 2019\"\r\n  )\r\n\r\n\r\n\r\n\r\nCe graphique permet de repérer les principales dynamiques de vote:\r\nOn vote davantage en semaine que le week-end, avec une participation plus soutenue en soirée du mardi au jeudi\r\nUn pic de votes vers 9h-10h en semaine, peut-être consécutifs aux tractages fait par des militants sur les pistes le matin, l’une des principales méthodes de diffusion du baromètre\r\nUn pic majeur de votes le jeudi en fin d’après-midi. Ce fort résultat ne semble pas dû à la présence d’outliers statistiques.\r\nConclusion\r\nL’interprétation de ce résultat du point de vue des associations reste à faire : faut-il exploiter les moments de plus forte participation en concentrant la diffusion sur ces créneaux ? À l’inverse, la plus fainle participation le week-end doit-elle être interprétée comme un moment de moindre présence en ligne des participants potentiels, ou comme le résultat d’une moindre mobilisation des militants ces jours ?\r\nLa campagne du Baromètre de 2021 permettra peut-être d’affiner ce regard, puisque les militants ont mis en place depuis la mi-novembre de nouveaux modes de diffusion très efficaces sur les réseaux sociaux, avec un triplement la participation journalière moyenne ! À ce rythme, le baromètre dépassera facilement cette année les 250 000 réponses. La comparaison entre le début et la fin de campagne permettra donc certainement d’évaluer l’effet de la mobilisation à des horaires moins conventionnels via les réseaux sociaux sur le profil horaire et hebdomadaire du vote.\r\n\r\nSource: https://public.tableau.com/app/profile/fub4080/viz/Patricipation2019_15682251368940/Participation_1↩︎\r\n",
    "preview": "posts/2021-11-24-a-quelle-heure-votent-les-cyclistes/a-quelle-heure-votent-les-cyclistes_files/figure-html5/unnamed-chunk-4-1.png",
    "last_modified": "2021-11-25T17:28:52+01:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Lancement du blog",
    "description": "Bienvenue sur ce blog !",
    "author": [
      {
        "name": "Maxime Agator",
        "url": {
          "https://mxagat.github.io/donnees-de-curiosite/": {}
        }
      }
    ],
    "date": "2021-06-18",
    "categories": [
      "infos"
    ],
    "contents": "\r\n\r\nbody {\r\ntext-align: justify}\r\nBienvenue sur ce blog !\r\nVous trouverez ici des analyses de données sur des thèmes aussi divers que le vélo et les transports urbains, la corruption, la démographie, ou - en toute originalité - le covid 19. Ce cabinet de curiosité numérique répond, comme ceux du XIXème, d’abord à la curiosité de son propriétaire, mais en laissant bien sûr de côté la recherche d’exotisme propre à la période coloniale.\r\nLa data des magazinesL’idée de ce blog est née lors de mon apprentissage du logiciel statistique R au cours de mes années de thèse en sociologie. D’un côté, j’ai été émerveillé - n’ayons pas peur des mots - par les possibilités offertes par l’analyse des données pour comprendre les phénomènes sociaux et, in fine, pouvoir agir en connaissance de cause. Je ne parle pas même ici de modèles statistiques très poussés comme le machine learning les réseaux de neurones, mais bien de méthodes statistiques descriptives bien utilisées pour cerner les grandes dimensions d’un phénomène. Il est toujours surprenant de constater à quel point même cet usage simple des données reste rare, et comme ce potentiel est sous exploité, y compris par les professionnels de l’information et des connaissances.\r\nComment cela s’explique-t-il ? Les raisons à cela sont sans doute nombreuses : sources de données mal connues ou identifiées, manque de formation statistique, ou encore poids des habitudes. Comment expliquer sinon la place royale réservée dans la presse à un outil comme la moyenne, un indicateur souvent trompeur ? Rappelons la plaisanterie de statisticiens : “quand Bill Gates rentre dans un bar, en moyenne tous les clients sont millionaires”. En l’occurrence, on gagnerait souvent à s’intéresser à la médiane, ou encore mieux à la distribution des fréquences, souvent bien plus parlante.\r\nUn bon contre-exemple, distribution des richesses par Philippe Rioux / La dépêche du midi, 2018 1Cependant il s’agit là de technique, et la technique statistique, aussi importante soit-elle, ne suffit pas : pour comprendre un phénomène social, il faut toujours aussi interpréter, même Si c’est un exercice difficile. Et pour cause, interpréter implique de mobiliser des informations ou des concepts extérieurs à la technique mathématique, qu’ils soient issus d’une connaissance de terrain, d’une expertise professionnelle ou d’une discipline scientifique comme la sociologie.\r\nA sa modeste échelle et sans prétention scientifique, ce blog offrira donc un cadre pour mes explorations curieuses et permettra peut-être de montrer qu’avec des données bien employées et de méthodes statistiques simples, on peut comprendre davantage et - sait-on jamais ? - agir mieux.\r\nVos remarques et commentaires constructifs seront évidemment les bienvenus.\r\nBonne lecture !\r\nMaxime Agator\r\nRiche, pauvre : quel Français êtes-vous ?” La dépêche du midi, 07/06/2018. https://www.ladepeche.fr/article/2018/06/07/2812978-riche-pauvre-quel-francais-etes-vous.html\r\n\r\n↩︎\r\n",
    "preview": "posts/welcome/media/colorful.jpg",
    "last_modified": "2021-11-25T18:07:40+01:00",
    "input_file": {}
  }
]
